tutorials/modules/multiRegion/film/cylinderVoF/constant/film/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

filmCloudTransfer
{
    type    filmCloudTransfer;

    libs    ("libfilmCloudTransfer.so");
}

filmVoFTransfer
{
    type    filmVoFTransfer;

    libs    ("libfilmVoFTransfer.so");

    deltaFactorToVoF  0.3;
    alphaToVoF        0.3;

    transferRateCoeff 0.1;
}

// ************************************************************************* //
